In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
a=pd.read_csv('D:/afsal/dataset/salaries.csv')

In [3]:
a.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,MI,FT,Machine Learning Engineer,130000,USD,130000,US,0,US,M
1,2022,MI,FT,Machine Learning Engineer,90000,USD,90000,US,0,US,M
2,2022,MI,FT,Data Scientist,120000,USD,120000,US,100,US,M
3,2022,MI,FT,Data Scientist,100000,USD,100000,US,100,US,M
4,2022,MI,FT,Data Scientist,85000,USD,85000,US,100,US,M

In [4]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1332 entries, 0 to 1331
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           1332 non-null   int64
 1   experience_level    1332 non-null   object
 2   employment_type     1332 non-null   object
 3   job_title           1332 non-null   object
 4   salary              1332 non-null   int64
 5   salary_currency     1332 non-null   object
 6   salary_in_usd       1332 non-null   int64
 7   employee_residence  1332 non-null   object
 8   remote_ratio        1332 non-null   int64
 9   company_location    1332 non-null   object
 10  company_size        1332 non-null   object
dtypes: int64(4), object(7)
memory usage: 114.6+ KB

In [5]:
a.isna().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [6]:
a.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [7]:
a.experience_level.nunique()

4

In [8]:
a.employment_type.nunique()

4

In [9]:
a.company_location.unique()

array(['US', 'ES', 'GB', 'FR', 'CA', 'MX', 'BR', 'IN', 'AU', 'SG', 'PT',
       'DE', 'NG', 'CZ', 'TR', 'PR', 'FI', 'AS', 'TH', 'NL', 'GR', 'DK',
       'BO', 'PH', 'AL', 'AR', 'BE', 'ID', 'AT', 'EG', 'IT', 'AE', 'IE',
       'LU', 'SI', 'MY', 'EE', 'PL', 'HN', 'CH', 'PK', 'JP', 'DZ', 'RO',
       'IQ', 'RU', 'UA', 'CN', 'HU', 'KE', 'CO', 'NZ', 'IR', 'CL', 'MD',
       'VN', 'HR', 'IL', 'MT'], dtype=object)

In [10]:
from sklearn import preprocessing
  
# label_encoder object knows how to understand word labels.
label_encoder = preprocessing.LabelEncoder()
  
# Encode labels in column 'species'.
a['experience_level']= label_encoder.fit_transform(a['experience_level'])
  
a['experience_level'].unique()

array([2, 3, 1, 0])

In [11]:
a['employment_type']= label_encoder.fit_transform(a['employment_type'])
  
a['employment_type'].unique()

array([2, 3, 0, 1])

In [12]:
a.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,2,2,Machine Learning Engineer,130000,USD,130000,US,0,US,M
1,2022,2,2,Machine Learning Engineer,90000,USD,90000,US,0,US,M
2,2022,2,2,Data Scientist,120000,USD,120000,US,100,US,M
3,2022,2,2,Data Scientist,100000,USD,100000,US,100,US,M
4,2022,2,2,Data Scientist,85000,USD,85000,US,100,US,M

In [13]:
a['job_title']= label_encoder.fit_transform(a['job_title'])
  
a['job_title'].unique()

array([47, 30, 21, 38, 15,  6,  2, 61, 24, 45, 20, 25,  0, 52, 28, 54, 60,
       26, 23,  7,  9, 56, 49,  5, 43, 44, 53, 62, 17, 35,  1, 31, 29, 32,
       10,  4, 50, 51, 46, 22, 34, 37, 14, 16, 59, 48,  3, 11, 19, 42, 40,
       27, 39, 13, 55, 18, 58, 57, 41, 33, 12,  8, 63, 36])

In [14]:
a['salary_currency']= label_encoder.fit_transform(a['salary_currency'])
  
a['salary_currency'].unique()

array([17,  8,  9,  2, 11,  0,  6,  1,  7, 15,  5, 14,  3, 12, 10, 13, 16,
        4])

In [15]:
a=a.drop(['employee_residence','company_location'],axis=1)

In [16]:
a['company_size']= label_encoder.fit_transform(a['company_size'])
  
a['company_size'].unique()

array([1, 0, 2])

In [17]:
a.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,remote_ratio,company_size
0,2022,2,2,47,130000,17,130000,0,1
1,2022,2,2,47,90000,17,90000,0,1
2,2022,2,2,30,120000,17,120000,100,1
3,2022,2,2,30,100000,17,100000,100,1
4,2022,2,2,30,85000,17,85000,100,1

In [18]:
a.columns
y=a['salary_in_usd']
x=a.drop('salary_in_usd',axis=1)

In [19]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,random_state=42,test_size=0.2)

In [20]:
from sklearn import linear_model
lr=linear_model.LinearRegression()

model=lr.fit(x_train,y_train)
prediction=model.predict(x_test)

In [21]:
prediction

array([135956.36589006,  91714.27745988, 168793.21152226, 161545.49207328,
       143454.59044598, 143554.29929184, 149192.69870656, 108649.73460448,
       142621.26678734, 161105.8670874 , 154532.69178883, 149153.47267128,
       113057.03510289, 142630.60631955, 143597.48528878, 142596.29910457,
       149251.22644173, 139192.97430028, 129694.74879943, 143535.53305846,
       122436.16071132, 122211.00628528, 118872.79917645, 129750.16335721,
       137520.95040544, 139204.80437441,  72336.34846544, 144866.95110636,
       142636.83267435, 138269.25019621,  78016.03198241,  73253.72791397,
       142636.83267435, 142603.39714905, 161583.5973647 , 156965.35366123,
       121275.88172556, 127099.74173674, 138262.51950667,  59302.14340492,
       143128.76849958, 142621.26678734, 172019.6087106 , 139184.88003903,
       149151.60476484, 111143.03053413, 129959.91332195, 149201.41560329,
       138284.31174849,  57968.2269506 , 141907.78047974,  81484.9551267 ,
       138281.19857108, 142625.00260022,  36615.08785666, 139198.20443832,
       143519.53132661,  45060.69818285, 128781.72779927, 138278.53369123,
       128622.44086496, 128784.84097668, 113300.58716812,  37806.73957271,
        70563.95610802, 133270.32006114, 142617.53097445, 143602.15505488,
       142611.92725513, 128763.04873486, 125354.71013968,  98779.57800801,
       154547.75956746, 142608.81407773, 129261.99290136,  84177.05812357,
       149178.3780905 ,  76695.09574611, 129633.73052233, 111861.7120146 ,
       149358.36202897, 121784.7065382 , 162038.56336874, 125818.06963004,
        84104.24497314,  90907.87045348, 143568.53273893,  87862.47415321,
       142611.92725513,  76691.98256871,  79787.41752219,  50502.33938075,
       128998.25309833,  79095.16875342, 162508.19938479,  40348.55019872,
       147844.59915522, 143519.53132661, 122236.84565773, 161106.98783126,
       141950.7423279 , 142658.62491617, 149170.28382926, 139196.77237671,
       109519.92378791,  89508.10572935, 143579.1175421 , 149163.13908712,
        84167.71859136, 141110.47616259, 142549.66370707, 129801.45058155,
       149217.0499802 ,  70558.97502418, 118158.81932761, 119737.44790037,
       149139.15205523,  72405.27339451, 153833.21477955,  77581.34342061,
       147682.45228795,  60929.27877863, 149158.80243099, 142625.00260022,
       142658.62491617,  93338.6657737 , 155464.88996179, 142624.37996474,
       139390.19789944, 150126.01762338,  88962.78260379, 142664.85127098,
       139213.70806178, 148617.88816541, 108003.32052903,  76685.75621391,
        25477.69016943, 152771.96031869,  70552.74866937,  89176.90408169,
        77593.79613022, 128135.66659144,  94789.77317265, 132180.53287075,
        66203.34092091, 143560.87432252, 148428.77892503, 142662.5475197 ,
       143485.72222001,  29491.68402576,  24206.60883104,  25120.48403548,
       153793.30384524, 154581.25735632,  70601.49739186, 149196.06093815,
       147695.52763304, 155421.30672342, 143602.15505488, 149194.23972937,
       148425.04311215,  17096.63644113,  94505.16050372, 150087.0406423 ,
       143479.49586521, 142768.87368082, 158801.66637201, 142618.15360994,
       142596.36136811, 148444.2825485 , 117067.02828856, 143577.81000759,
       128806.6332185 , 105973.17822364, 162289.48751943, 138237.02258374,
       141873.53552831, -10874.09764333, 162441.88870611,  31715.72806971,
       152888.39315356, 149201.41560329, 161820.59866596,  84104.24497314,
        77618.70154944,  95454.83266944, 149179.48638166, 138290.33885994,
       142642.43639368, 143535.53305846, 111635.60694603, 142565.22959408,
        40918.68665835,  66055.8935197 , 150113.19133248, 138296.7644581 ,
       143553.40269675, 149163.13908712, 163040.95459135, 149163.13908712,
       161545.49207328, 142599.47454552, 162494.00578638, 114800.18382217,
       149195.18924848, 132233.23273783, 142667.96444838, 150075.21056817,
       142617.90455574,  61640.54796015,  88269.37077107, 112369.59556472,
        90209.23392104, 138276.27975079, 139163.27458786, 138256.91578734,
       144209.51145098,  99674.46822302, 139216.21977331, 149194.23972937,
       149151.60476484,  23724.48482068, 109415.49978472, 104260.42598108,
        79422.61815734, 138240.72726485,  89441.25072596, 150105.47065252,
       149186.47235175, 141172.50193032,  74919.50050809, 139205.42700989,
       143579.74017758,  73893.36494515, 149151.60476484, 184905.74579571,
        79801.26843003, 161071.43534532,  84772.52323642,  42400.03714504,
       149194.23972937, 131325.71018889, 138303.98702967, 129553.75130102,
       130923.55652013,  67373.42272337, 150681.31223433,  84096.15071189,
        94805.33905967, 142590.13501331, 149251.22644173, 143602.15505488,
        56200.98769662, 142573.94649081,  83224.18845266, 142590.13501331,
       154561.76886578, 161148.20630008, 139217.25708403, 142565.22959408,
       101132.56413065, 143572.8911873 , 150090.77645518, 153692.45294461,
       166362.15447599, 161543.00153136, 161592.18973433])

In [22]:
from sklearn.metrics import mean_squared_error
print('MSC is:',mean_squared_error(y_test,prediction))

MSC is: 3031935834.457652